Информационная_база/src/AccumulationRegisters/РасчетыСФондамиПоСтраховымВзносам/РасчетыСФондамиПоСтраховымВзносам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РасчетыСФондамиПоСтраховымВзносам</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <comment>Это может быть как головная организация, так и обособленное подразделение</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидОбязательногоСтрахованияСотрудников</name>
    <type>
      <types>EnumRef.ВидыОбязательногоСтрахованияСотрудников</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭтоСтраховыеВзносы</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭтоРасчетыПоНачислениюУплатеВзносовВФСС</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Информационная_база/src/AccumulationRegisters/РасчетыСФондамиПоСтраховымВзносам/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура создает пустую временную таблицу изменения движений.
//
Процедура СоздатьПустуюВременнуюТаблицуИзменение(ДополнительныеСвойства) Экспорт
	
	Если НЕ ДополнительныеСвойства.Свойство("ДляПроведения")
	 ИЛИ НЕ ДополнительныеСвойства.ДляПроведения.Свойство("СтруктураВременныеТаблицы") Тогда	
		Возврат;		
	КонецЕсли;
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 0
	|	РасчетыСФондамиПоСтраховымВзносам.НомерСтроки КАК НомерСтроки,
	|	РасчетыСФондамиПоСтраховымВзносам.ВидДвижения КАК ВидДвижения,
	|	РасчетыСФондамиПоСтраховымВзносам.Организация КАК Организация,
	|	РасчетыСФондамиПоСтраховымВзносам.ВидОбязательногоСтрахованияСотрудников КАК ВидОбязательногоСтрахованияСотрудников,
	|	РасчетыСФондамиПоСтраховымВзносам.Сотрудник КАК Сотрудник,
	|	РасчетыСФондамиПоСтраховымВзносам.ЭтоСтраховыеВзносы КАК ЭтоСтраховыеВзносы,
	|	РасчетыСФондамиПоСтраховымВзносам.ЭтоРасчетыПоНачислениюУплатеВзносовВФСС КАК ЭтоРасчетыПоНачислениюУплатеВзносовВФСС,
	|	РасчетыСФондамиПоСтраховымВзносам.Сумма КАК СуммаПередЗаписью,
	|	РасчетыСФондамиПоСтраховымВзносам.Сумма КАК СуммаИзменение,
	|	РасчетыСФондамиПоСтраховымВзносам.Сумма КАК СуммаПриЗаписи
	|ПОМЕСТИТЬ ДвиженияРасчетыСФондамиПоСтраховымВзносамИзменение
	|ИЗ
	|	РегистрНакопления.РасчетыСФондамиПоСтраховымВзносам КАК РасчетыСФондамиПоСтраховымВзносам");
	
	Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураВременныеТаблицы.Вставить("ДвиженияРасчетыСФондамиПоСтраховымВзносамИзменение", Ложь);
	
КонецПроцедуры // СоздатьПустуюВременнуюТаблицуИзменение()

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#КонецЕсли
